# 1
Вывести название колонки с максимальным значением

In [18]:
import pandas as pd
df = pd.read_csv("input.csv")
print(df.sum().idxmax(axis=1))

Вишенка

# 2
Выведите 
1
1, если Генадию хватит на новый Мерседес, если он соберет все дивиденды за все периоды, указанные в таблице. В обратном случае выведите 
0
0.

Также через пробел выведите 
n
a
m
e
i
name 
i
​
  — название наиболее прибыльной (суммарно) бумаги.

In [48]:
import pandas as pd
df = pd.read_csv("input.csv")
S = df.to_numpy().sum()
if S >= 8000000:
    print(1, df.sum().idxmax(axis=1))
else:
    print(0)

1 Мыло.ру

# 3
Выведите через пробел имя лучшего работника 
name и день day, когда он выполнил план. Если таких работников несколько, то данные выводите построчно:

In [92]:
import pandas as pd
import numpy as np
df = pd.read_csv("input.csv")
summ = df.cumsum()
total = summ[summ >= df.sum().mean() * 1.5]
# print(summ[summ >= df.sum().mean() * 1.5])
# summ >= df.sum().mean() * 1.5
# print('\n'.join([f"{t} {df.first_valid_index()}" for t in total.loc[total.first_valid_index()].dropna().index.to_list()]))
# df.cumsum()
# df.sum().mean()
# df
total
# df1 = np.where(~pd.isnull(total))
df1 = total[total.isna()]
df1

   Петр  Иван  Елисей  Потап  Евгений  Сергей
0   NaN   NaN     NaN    NaN      NaN     NaN
1   NaN   NaN     NaN    NaN      NaN     NaN
2   NaN   NaN     NaN    NaN      NaN     NaN

In [54]:
summ

   Петр  Иван  Елисей  Потап  Евгений  Сергей
0    88   268     253    564      281     861
1   296   424     391   1168      329    1620
2   551   753     653   1721      476    2393